<footer class="footer container-fluid">
    <div class="footer-container">
        <section class="footer-subscribe">
            <div class="footer-subscribe-text">Оставьте свою почту и станьте первым,<br>
                кто получит скидку на новые самокаты</div>
            <div class="footer-subscribe-right">
                <x-input placeholder="Введите ваш email" class="input-violet"></x-input>
                <x-btn class="btn-white big-btn">Подписаться</x-btn>
            </div>
        </section>

        <section class="footer-links">
            <div class="footer-link footer-links-catalog">
                <h5 class="footer-link-header">Каталог товаров</h5>
                <div class="footer-link-context">
                    <ul class="footer-link-items">
                        <x-link class="link-grey">Электросамокаты</x-link>
                        <x-link class="link-grey">Электроскутеры</x-link>
                        <x-link class="link-grey">Электровелосипеды</x-link>
                        <x-link class="link-grey">Электромотоциклы</x-link>
                    </ul>
                </div>
            </div>
            <div class="footer-link footer-links-buyers">
                <h5 class="footer-link-header">Покупателям</h5>
                <div class="footer-link-context">
                    <ul class="footer-link-items">
                        <x-link class="link-grey">Сервисный центр</x-link>
                        <x-link class="link-grey">Доставка и оплата</x-link>
                        <x-link class="link-grey">Рассрочка</x-link>
                        <x-link class="link-grey">Тест-драйв</x-link>
                    </ul>
                    <ul class="footer-link-items">
                        <x-link class="link-grey">Блог</x-link>
                        <x-link class="link-grey">Сотрудничество</x-link>
                        <x-link class="link-grey">Контакты</x-link>
                        <x-link class="link-grey">Акции</x-link>
                    </ul>
                </div>
            </div>
            <div class="footer-link footer-links-contacts">
                <div class="footer-links-contacts-top">
                    <h5 class="footer-link-header">Контакты</h5>
                    <x-link class="link-underline link-bold">Заказать звонок</x-link>
                </div>
                <div class="footer-links-contacts-body">
                    <ul class="footer-links-contacts-items">
                        <li class="footer-links-item">
                            <div class="name">Call-центр</div>
                            <a href="tel:+78005055461" class="number">+7 (800) 505-54-61</a>
                            <div class="works-day">
                                Пн-Вс 10:00 - 20:00
                            </div>
                            <div class="address">
                                <div class="place">Магазин в Москве <br>ул. Ткацкая, 5 стрю 16</div>
                                <div class="address-number">+7 (499) 406 15 87</div>
                            </div>
                        </li>
                        <li class="footer-links-item">
                            <div class="name">Сервисный центр</div>
                            <a href="tel:+74993507692" class="number">+7 (499) 350-76-92</a>
                            <div class="works-day">
                                Пн-Вс 10:00 - 20:00
                            </div>
                            <div class="address">
                                <div class="place">Магазин в Санкт-Петербурге <br>ул. Фрунзе, 2</div>
                                <div class="address-number">+7 (499) 406 15 87</div>
                            </div>
                        </li>
                        <li class="footer-links-item">
                            <div class="name"></div>
                            <a class="number"></a>
                            <div class="works-day"></div>
                            <div class="address">
                                <div class="place">Магазин в Краснодаре, <br>ул. Восточно-Кругликовская, 86</div>
                                <div class="address-number">+7 (800) 505 54 61</div>
                            </div>
                        </li>
                    </ul>
                </div>
            </div>
        </section>

        <section class="footer-media">
            <svg class="kugoo-brand" xmlns="http://www.w3.org/2000/svg" width="160" height="32" viewBox="0 0 113 23" fill="none">
                <path d="M0.22 0.999999V22H5.47V0.999999H0.22ZM12.61 0.999999L4 10.99L12.85 22H19L10.03 10.84L18.55 0.999999H12.61ZM21.0466 0.999999V15.1C21.0466 16.42 21.2566 17.57 21.6766 18.55C22.1166 19.53 22.7166 20.34 23.4766 20.98C24.2566 21.6 25.1566 22.07 26.1766 22.39C27.1966 22.71 28.2966 22.87 29.4766 22.87C30.6566 22.87 31.7566 22.71 32.7766 22.39C33.8166 22.07 34.7166 21.6 35.4766 20.98C36.2566 20.34 36.8566 19.53 37.2766 18.55C37.7166 17.57 37.9366 16.42 37.9366 15.1V0.999999H32.8666V14.74C32.8666 15.8 32.5866 16.66 32.0266 17.32C31.4666 17.98 30.6166 18.31 29.4766 18.31C28.3566 18.31 27.5166 17.98 26.9566 17.32C26.3966 16.66 26.1166 15.8 26.1166 14.74V0.999999H21.0466ZM52.6417 14.41H58.2217C58.0417 14.95 57.7917 15.46 57.4717 15.94C57.1717 16.4 56.7917 16.81 56.3317 17.17C55.8917 17.51 55.3617 17.78 54.7417 17.98C54.1417 18.16 53.4617 18.25 52.7017 18.25C51.4617 18.25 50.3617 17.98 49.4017 17.44C48.4617 16.88 47.7117 16.1 47.1517 15.1C46.6117 14.08 46.3417 12.88 46.3417 11.5C46.3417 10.1 46.6217 8.92 47.1817 7.96C47.7617 6.98 48.5317 6.23 49.4917 5.71C50.4517 5.19 51.5217 4.93 52.7017 4.93C53.9217 4.93 54.9317 5.21 55.7317 5.77C56.5517 6.31 57.2017 7 57.6817 7.84L62.1817 5.5C61.5217 4.52 60.7317 3.66 59.8117 2.92C58.9117 2.16 57.8717 1.57 56.6917 1.15C55.5117 0.729999 54.1817 0.519999 52.7017 0.519999C51.0417 0.519999 49.5017 0.779999 48.0817 1.3C46.6617 1.82 45.4217 2.56 44.3617 3.52C43.3017 4.48 42.4817 5.64 41.9017 7C41.3217 8.34 41.0317 9.84 41.0317 11.5C41.0317 13.16 41.3117 14.68 41.8717 16.06C42.4517 17.42 43.2517 18.6 44.2717 19.6C45.2917 20.58 46.5017 21.34 47.9017 21.88C49.3017 22.4 50.8417 22.66 52.5217 22.66C54.3017 22.66 55.8817 22.35 57.2617 21.73C58.6417 21.09 59.7917 20.21 60.7117 19.09C61.6317 17.97 62.3117 16.68 62.7517 15.22C63.1917 13.76 63.3617 12.19 63.2617 10.51H52.6417V14.41ZM70.8353 11.5C70.8353 10.26 71.0753 9.17 71.5553 8.23C72.0553 7.27 72.7453 6.52 73.6253 5.98C74.5253 5.44 75.5753 5.17 76.7753 5.17C77.9953 5.17 79.0453 5.44 79.9253 5.98C80.8053 6.52 81.4853 7.27 81.9653 8.23C82.4453 9.17 82.6853 10.26 82.6853 11.5C82.6853 12.74 82.4353 13.84 81.9353 14.8C81.4553 15.74 80.7653 16.48 79.8653 17.02C78.9853 17.56 77.9553 17.83 76.7753 17.83C75.5753 17.83 74.5253 17.56 73.6253 17.02C72.7453 16.48 72.0553 15.74 71.5553 14.8C71.0753 13.84 70.8353 12.74 70.8353 11.5ZM65.4653 11.5C65.4653 13.12 65.7353 14.61 66.2753 15.97C66.8353 17.33 67.6153 18.51 68.6153 19.51C69.6353 20.51 70.8353 21.29 72.2153 21.85C73.5953 22.39 75.1153 22.66 76.7753 22.66C78.4153 22.66 79.9253 22.39 81.3053 21.85C82.6853 21.29 83.8753 20.51 84.8753 19.51C85.8953 18.51 86.6753 17.33 87.2153 15.97C87.7753 14.61 88.0553 13.12 88.0553 11.5C88.0553 9.88 87.7753 8.4 87.2153 7.06C86.6553 5.72 85.8653 4.56 84.8453 3.58C83.8253 2.6 82.6253 1.85 81.2453 1.33C79.8853 0.789999 78.3953 0.519999 76.7753 0.519999C75.1753 0.519999 73.6853 0.789999 72.3053 1.33C70.9253 1.85 69.7253 2.6 68.7053 3.58C67.6853 4.56 66.8853 5.72 66.3053 7.06C65.7453 8.4 65.4653 9.88 65.4653 11.5ZM95.474 11.5C95.474 10.26 95.714 9.17 96.194 8.23C96.694 7.27 97.384 6.52 98.264 5.98C99.164 5.44 100.214 5.17 101.414 5.17C102.634 5.17 103.684 5.44 104.564 5.98C105.444 6.52 106.124 7.27 106.604 8.23C107.084 9.17 107.324 10.26 107.324 11.5C107.324 12.74 107.074 13.84 106.574 14.8C106.094 15.74 105.404 16.48 104.504 17.02C103.624 17.56 102.594 17.83 101.414 17.83C100.214 17.83 99.164 17.56 98.264 17.02C97.384 16.48 96.694 15.74 96.194 14.8C95.714 13.84 95.474 12.74 95.474 11.5ZM90.104 11.5C90.104 13.12 90.374 14.61 90.914 15.97C91.474 17.33 92.254 18.51 93.254 19.51C94.274 20.51 95.474 21.29 96.854 21.85C98.234 22.39 99.754 22.66 101.414 22.66C103.054 22.66 104.564 22.39 105.944 21.85C107.324 21.29 108.514 20.51 109.514 19.51C110.534 18.51 111.314 17.33 111.854 15.97C112.414 14.61 112.694 13.12 112.694 11.5C112.694 9.88 112.414 8.4 111.854 7.06C111.294 5.72 110.504 4.56 109.484 3.58C108.464 2.6 107.264 1.85 105.884 1.33C104.524 0.789999 103.034 0.519999 101.414 0.519999C99.814 0.519999 98.324 0.789999 96.944 1.33C95.564 1.85 94.364 2.6 93.344 3.58C92.324 4.56 91.524 5.72 90.944 7.06C90.384 8.4 90.104 9.88 90.104 11.5Z" fill="#282739"/>
            </svg>
            <x-brand-card top="Доступно на" bottom="Google Play">
                <svg xmlns="http://www.w3.org/2000/svg" height="25" width="25" viewBox="0 0 512 512" xml:space="preserve">
                            <path d="M430.472 227.608c17.25 12.85 17.25 41.79 1.08 54.641l-45.509 25.77-67.441-53.09 67.607-52.077 44.263 24.756z" style="fill:#ffc801"/>
                    <path d="m386.396 307.769-.01-.01h-.01l-67.835-52.801-.021-.02-.01.01.021.021-.021-.021-.03-.03-.239.181-249.79 190.25v7.95c-.001 10.503 2.457 21.705 10.845 25.595 11.052 5.125 27.177-4.892 27.177-4.892l279.923-166.233z" style="fill:#f93647"/>
                    <path style="fill:#00d3ff" d="m318.242 255.099-249.79 190.25V60.588l249.73 194.431z"/>
                    <path d="M68.452 56.738v3.85l249.729 194.431.061.08.239-.181.021-.01.1-.08 67.607-51.685S168.776 73.151 105.744 35.661c-2.742-1.631-9.313-5.768-17.192-3.188-9.439 3.092-20.1 14.32-20.1 24.265z" style="fill:#00ef77"/>
                </svg>
            </x-brand-card>
            <x-brand-card top="Загрузите в" bottom="App Store">
                <svg xmlns="http://www.w3.org/2000/svg" width="21" height="27" viewBox="0 0 21 27" fill="none">
                    <path d="M17.5767 14.3758C17.5893 13.3993 17.8487 12.4419 18.3307 11.5926C18.8127 10.7434 19.5017 10.0298 20.3336 9.51836C19.8052 8.7636 19.108 8.14246 18.2974 7.70428C17.4869 7.26609 16.5854 7.02294 15.6645 6.99413C13.6999 6.78791 11.7954 8.16966 10.7943 8.16966C9.77387 8.16966 8.23256 7.0146 6.5728 7.04874C5.49923 7.08343 4.45295 7.39562 3.5359 7.95489C2.61886 8.51416 1.86232 9.30145 1.34001 10.24C-0.92249 14.1573 0.765134 19.9143 2.93246 23.0808C4.01682 24.6313 5.28412 26.3632 6.94238 26.3018C8.56508 26.2345 9.17113 25.2671 11.1299 25.2671C13.0704 25.2671 13.639 26.3018 15.3309 26.2628C17.0722 26.2345 18.1692 24.7054 19.2155 23.1402C19.9947 22.0354 20.5942 20.8144 20.9919 19.5223C19.9803 19.0945 19.117 18.3783 18.5097 17.4631C17.9024 16.5479 17.5779 15.4742 17.5767 14.3758Z" fill="#282739"/>
                    <path d="M14.3801 4.91175C15.3295 3.77204 15.7972 2.30713 15.684 0.828125C14.2335 0.980467 12.8937 1.67369 11.9315 2.76967C11.461 3.30509 11.1007 3.92798 10.8711 4.60273C10.6415 5.27749 10.5472 5.99087 10.5935 6.70211C11.319 6.70958 12.0367 6.55233 12.6926 6.24221C13.3485 5.93209 13.9255 5.47718 14.3801 4.91175Z" fill="#282739"/>
                </svg>
            </x-brand-card>
            <div class="footer-media-right">
                <x-brand-card top="Вконтакте" bottom="3300">
                    <svg class="kugoo-api-subscribe-label" xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none">
                        <g clip-path="url(#clip0_213_15774)">
                            <path
                                d="M16.5958 10.857C16.2725 10.4487 16.365 10.267 16.5958 9.90199C16.6 9.89783 19.2692 6.20949 19.5442 4.95866L19.5458 4.95783C19.6825 4.50199 19.5458 4.16699 18.885 4.16699H16.6983C16.1417 4.16699 15.885 4.45449 15.7475 4.77616C15.7475 4.77616 14.6342 7.44116 13.0592 9.16866C12.5508 9.66783 12.3158 9.82783 12.0383 9.82783C11.9017 9.82783 11.6892 9.66783 11.6892 9.21199V4.95783C11.6892 4.41116 11.5333 4.16699 11.0725 4.16699H7.63417C7.285 4.16699 7.0775 4.42199 7.0775 4.65949C7.0775 5.17783 7.865 5.29699 7.94667 6.75533V9.91949C7.94667 10.6128 7.82083 10.7403 7.54167 10.7403C6.79833 10.7403 4.99417 8.06449 3.925 5.00199C3.70917 4.40783 3.49833 4.16783 2.9375 4.16783H0.75C0.125833 4.16783 0 4.45533 0 4.77699C0 5.34533 0.743333 8.17116 3.45667 11.9045C5.265 14.4528 7.81167 15.8337 10.1283 15.8337C11.5208 15.8337 11.6908 15.527 11.6908 14.9995C11.6908 12.5645 11.565 12.3345 12.2625 12.3345C12.5858 12.3345 13.1425 12.4945 14.4425 13.7237C15.9283 15.1812 16.1725 15.8337 17.0042 15.8337H19.1908C19.8142 15.8337 20.13 15.527 19.9483 14.922C19.5325 13.6495 16.7225 11.032 16.5958 10.857Z"
                                fill="#4B729F"></path>
                        </g>
                        <defs>
                            <clipPath id="clip0_213_15774">
                                <rect width="20" height="20" fill="white"></rect>
                            </clipPath>
                        </defs>
                    </svg>
                </x-brand-card>
                <x-brand-card top="Instagram" bottom="10602">
                    <svg class="kugoo-api-subscribe-label" xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none"><path d="M13.75 0H6.25C2.79875 0 0 2.79875 0 6.25V13.75C0 17.2013 2.79875 20 6.25 20H13.75C17.2013 20 20 17.2013 20 13.75V6.25C20 2.79875 17.2013 0 13.75 0ZM18.125 13.75C18.125 16.1625 16.1625 18.125 13.75 18.125H6.25C3.8375 18.125 1.875 16.1625 1.875 13.75V6.25C1.875 3.8375 3.8375 1.875 6.25 1.875H13.75C16.1625 1.875 18.125 3.8375 18.125 6.25V13.75Z" fill="url(#paint0_linear_213_15785)"></path><path d="M10 5C7.23875 5 5 7.23875 5 10C5 12.7613 7.23875 15 10 15C12.7613 15 15 12.7613 15 10C15 7.23875 12.7613 5 10 5ZM10 13.125C8.2775 13.125 6.875 11.7225 6.875 10C6.875 8.27625 8.2775 6.875 10 6.875C11.7225 6.875 13.125 8.27625 13.125 10C13.125 11.7225 11.7225 13.125 10 13.125Z" fill="url(#paint1_linear_213_15785)"></path><path d="M15.3733 5.29148C15.7412 5.29148 16.0395 4.99319 16.0395 4.62523C16.0395 4.25727 15.7412 3.95898 15.3733 3.95898C15.0053 3.95898 14.707 4.25727 14.707 4.62523C14.707 4.99319 15.0053 5.29148 15.3733 5.29148Z" fill="url(#paint2_linear_213_15785)"></path><defs><linearGradient id="paint0_linear_213_15785" x1="1.83081" y1="18.1693" x2="18.1692" y2="1.83069" gradientUnits="userSpaceOnUse"><stop stop-color="#FFC107"></stop><stop offset="0.507" stop-color="#F44336"></stop><stop offset="0.99" stop-color="#9C27B0"></stop></linearGradient><linearGradient id="paint1_linear_213_15785" x1="6.46456" y1="13.5354" x2="13.5354" y2="6.46456" gradientUnits="userSpaceOnUse"><stop stop-color="#FFC107"></stop><stop offset="0.507" stop-color="#F44336"></stop><stop offset="0.99" stop-color="#9C27B0"></stop></linearGradient><linearGradient id="paint2_linear_213_15785" x1="14.9022" y1="5.09642" x2="15.8443" y2="4.15417" gradientUnits="userSpaceOnUse"><stop stop-color="#FFC107"></stop><stop offset="0.507" stop-color="#F44336"></stop><stop offset="0.99" stop-color="#9C27B0"></stop></linearGradient></defs></svg>
                </x-brand-card>
                <x-brand-card top="YouTube" bottom="3603">
                    <svg class="kugoo-api-subscribe-label" xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none"><g clip-path="url(#clip0_213_15798)"><path d="M0.436161 14.8949C0.844494 16.3433 2.09366 16.6083 2.17699 16.6591C4.23283 17.2191 15.7562 17.2208 17.8428 16.6591C19.272 16.2458 19.5345 14.9783 19.5837 14.8949C20.1278 11.9999 20.1637 8.22575 19.5587 4.94075L19.5837 5.10409C19.1753 3.65575 17.9262 3.39075 17.8428 3.33992C15.8145 2.78909 4.26116 2.76825 2.17699 3.33992C0.747827 3.75409 0.485327 5.02075 0.436161 5.10409C-0.146339 8.14659 -0.175506 11.6374 0.436161 14.8949ZM8.00783 13.0424V6.96492L13.2295 10.0083L8.00783 13.0424Z" fill="#E53935"></path></g><defs><clipPath id="clip0_213_15798"><rect width="20" height="20" fill="white"></rect></clipPath></defs></svg>
                </x-brand-card>
                <x-brand-card top="Telegram" bottom="432">
                    <svg class="kugoo-api-subscribe-label" xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20" fill="none"><g clip-path="url(#clip0_213_15806)"><path d="M7.84765 12.651L7.51682 17.3043C7.99015 17.3043 8.19515 17.101 8.44098 16.8568L10.6602 14.736L15.2585 18.1035C16.1018 18.5735 16.696 18.326 16.9235 17.3277L19.9418 3.18434L19.9427 3.18351C20.2102 1.93684 19.4918 1.44934 18.6702 1.75518L0.928482 8.54767C-0.282352 9.01767 -0.264019 9.69267 0.722648 9.99851L5.25848 11.4093L15.7943 4.81684C16.2901 4.48851 16.741 4.67018 16.3701 4.99851L7.84765 12.651Z" fill="#039BE5"></path></g><defs><clipPath id="clip0_213_15806"><rect width="20" height="20" fill="white"></rect></clipPath></defs></svg>
                </x-brand-card>
            </div>
        </section>

        <section class="footer-payments">
            <x-link class="link-grey">Реквизиты</x-link>
            <x-link class="link-grey">Политика конфиденциальности</x-link>
            <div class="footer-payments-right">
                <x-banks class="card-payment" gpay="true" ipay="true"
                         visa="true" mastercard="true" maestro="true" webmoney="true" qiwi="true"
                            style="width: 445px">
                </x-banks>
                <div class="footer-payments-right-socials">
                    <div class="footer-payments-right-socials-header">Онлайн чат:</div>
                    <x-socials :height="16"></x-socials>
                </div>

            </div>
        </section>
    </div>
    <div class="footer-backgrounds">
        <div class="footer-backgrounds-subscribe"></div>
        <div class="footer-backgrounds-other"></div>
    </div>
</footer>
